[
  {
    "year": 2025,
    "data": [
      {
        "title": "Eye contact with another girl (2025)",
        "content": "I am the void residing in muscle, syllogism <abc>of the waking world, blood-logic concerned, <abc>must-habit returned, the apple offered  <abc> from that rotting green. There is nothing <abc> in the depths of the murky waters you do <abc>not yet know, as-above-so-below, the trail <abc>of red in snow. You reach your hand <abc>into the water, lamb into slaughter, and <abc>This is how drowning begins: red smudge <abc>on the teeth of sin and blue smudge on the <abc>surface of skin and the untwining of <abc>Black, dark, endless, clawing at hand, arm, shoulder, <abc>gnawing at sand, harm, boulder, before the <abc>sunset, the nets, the fleas, the great giant of <abc>the seas, flayed, bloodless flesh and dreamless eye, <abc>cold like clay, writhe like day. The tide will <abc>hold your wrist where you wait for Time’s linguist <abc>and I hope you will not resist, for you will not <abc>wilt and the Earth does not tilt for either of us, so  <abc>Here, take the moon, with its noose of silver ruin <abc>and Here, take the stars, with the smoking scent <abc>of char and Here, when you cease to fight, I will <abc>tuck you in, in this blinding white blight and <abc>kiss your tender forehead Good night, Good night."
      },
      {
        "title": "An Improvisation on the Color Blue (2025)",
        "content": "Of I, of sea, of mind, of he. He went down the blue and slept in the blue. I went down the blue and put him in the blue. The last color he saw was blue. The last color I saw of him was blue. He went down the blue, and the blue took him gently. The sky was red and orange, so he had to get to the blue. I wrapped him in blue because he was burnt raw. I wrapped him in blue so red could not burn his ashes any further. I learned that blue can bruise, and bruise can blue. At twenty I will have died to get back to the blue. Blue in my throat, blue in my bones, blue in the admitting-to.<abc><abc> I did not know that the hottest fires were blue. When the world ends, it does not bid adieu. I had no map, no road to go to, only the shores, which were blue. When the world ends, it closes its eyes in blue.<abc><abc> Somewhere, my father wakes and the first thing he sees is blue."
      },
      {
        "title": "Never have I held the gracious sunlight (2025)",
        "content": "Never have I held the gracious sunlight,<abc>Though oft I've watched it dance through morning air,<abc>Like golden birds in transient, heaving flight,<abc>Like liquid honey dripping warm and fair.<abc><abc>What mortal hand could grasp such fleeting light<abc>That slips between the spaces of our days?<abc>As well to catch the stars that crown the night,<abc>Or hold the dawn's first shimmer through the haze.<abc><abc>But wait—perhaps I err in this pursuit,<abc>For light was never meant for mortal hands;<abc>Its touch upon my skin bears sweeter fruit<abc>When freely given, devoid of demands.<abc><abc>So let me be the thing that light shines through,<abc>And find my grace in letting go of you.<abc>"
      },
      {
        "title": "When I Run,I’m Scared Of Stepping On A Snail (2025)",
        "content": "Scared of the sound it would make. Scared of<abc>the small, unsuspecting body. Scared of<abc>boots against the ground, the child who wandered<abc>in the wrong street, the child who slept<abc>in the wrong house, the child born<abc>in the wrong country. Know that I am heavy,<abc>that I am fast, that I kid myself that this<abc>language, this history is not drenched in blood,<abc>that when I speak English it is copper in my mouth.<abc>Know that the child who wandered in the wrong street<abc>across the world, right now<abc>is nothing but a crushed torso and feet.<abc>Know that the child who slept in the wrong house<abc>a few decades ago, right here<abc>is nothing but the snail by my heel.<abc><abc>What kind of sinner am I? What to do<abc>with all this devastation? Sometimes<abc>the cruelest terror is the absence we commit against<abc>ourselves.<abc><abc>I do not know what to do with my feet<abc>but run. How many more snails have to be crushed<abc>in this silence, how many more children have to die?<abc>"
      },
      {
        "title": "Interlude in Doorless, Windowless Room (2025)",
        "content": "One runs under the endless farce of mannequins<abc>peeking from their shop windows.<abc>Their plastic mouths creak softly,<abc>criss-crossing over the sky<abc>like wires overhead.<abc><abc>One runs away, away, away from the<abc>soft creak of plastic, the soft ache<abc>of being alive.<abc><abc>After all, what did we expect?<abc>There is no difference between the sound<abc>of a step and the sound of the clattering rain.<abc>There are pigeons, and no bread; benches,<abc>and no bodies.<abc><abc>I tear up the words stashed<abc>in my coat pocket, scatter the scraps.<abc>I reach into my pocket, and I have<abc>no letters left. The pigeons look at me, eye<abc>a drop of oil, and peck at cigarette butts.<abc>They dissolve at nothing, disappearing into the<abc>splintered light above the square.<abc><abc>Again, my hands have been clenched<abc>for hours. I am sorry.<abc>I thought the shadow under the streetlamp<abc>might’ve turned back its head.<abc><abc>Then, the moon drops into the fountain<abc>clacking on the water like spare change,<abc>and the silence returns, soft-footed,<abc>curling beside me, a fat black cat.<abc>"
      },
      {
        "title": "WANTED (2025)",
        "content": "IF YOU SEE ME PLEASE TEAR MY SHADOW<abc>OFF THE BASEMENT PLEASE DON’T LOOK<abc>at my body at the wall of my rubble at me or<abc>AWAY PLEASE DRAG ME OUT FROM<abc>THE TEETH OF THE STREET<abc><abc>DEAD OR ALIVE PLEASE RETURN-TO-SENDER<abc>DEAD OR ALIVE PLEASE STAMP MY NAME<abc>ON SOMETHING SOFT LIKE A CLOUD OR PILLOW<abc>something that accepts the shape of my head<abc>ANYTHING BUT THE HARD UNYIELDING NOW<abc><abc>IF YOU SEE ME PLEASE DON’T REPORT ME<abc>to the Authority of The Sky IF YOU SEE ME<abc>PLEASE DON’T DIM the fugitive glow of my eyes or<abc>THE STREETLIGHT MOON IF YOU SEE ME<abc>PLEASE see all of me<abc><abc>& STILL IF YOU SEE ME PLEASE don’t<abc>TURN AWAY TURN AWAY TURN AWAY<abc><abc>DEAD OR ALIVE YOU WILL PLACE ME<abc>BETWEEN THE PAGES OF SOME BOOK<abc>CLOSE THE COVER AND FORGET WHICH ONE<abc><abc>IF YOU SEE ME PLEASE don’t PRAY<abc>I AM ALREADY FULL OF HEAVEN’S SILENCE<abc><abc>& STILL IF YOU SEE ME PLEASE<abc>REMEMBER i am A CHILD<abc>REMEMBER i am REACHING OUT<abc><abc>& IF YOU DON’T REMEMBER<abc>TURN AWAY TURN AWAY TURN AWAY<abc>"
      },
      {
        "title": "Physical Education (2025)",
        "content": "A ball hit my face today. It’s fine, it’s fine, I said.<abc>It hurt, but I’d take another to the back of my head.<abc>Sunlight poured down the sides of my face, <abc>Red on my fingertips and the summer haze,<abc>Their voices blur into each other—You okay? Are you okay?<abc><abc>Tears pushed out of my eyes, oh yes, it hurt,<abc>I’m sorry. Apologize to them. Apologize to Earth.<abc>I’m not sure if the water streaming from my eyes <abc>are of pain or embarrassment, scorching or crystallized. <abc><abc>Oh, since you’re not playing, could you hold my glasses?<abc>Yeah, sure. In my hand, they weighed a thousand masses.<abc>The light droned on, every now and then, someone fell,<abc>Shouted apologies and hot wind whirled together in a well.<abc><abc>I put on the glasses. My fingers and the shade intertwined.<abc>I looked at my friends, light bleeding from their outlines.<abc>I touched my lips, my nose, the lenses, the spine of time, <abc>The match ends. In my mouth, blood tastes like lime.<abc>"
      },
      {
        "title": "A Brief History of (2025) Disappearing Staircases",
        "content": "Tomorrow, we will have woken up to the end of the<abc>[tab]world, blood-red lump in the sky scattering<abc>[tab]crimson over our heads, an unfertilized egg<abc>[tab]beckoning, our feet like tails. You will have <abc>[tab]closed the curtains but left the windows open<abc>[tab]and poured us both a glass of watermelon<abc>[tab]juice & two cubes of ice, two ants drowning<abc>[tab]in the sweet red sea. <abc><abc>[tab][tab]You will have washed the glasses, and I <abc>[tab][tab]will take another drink, watching<abc>[tab][tab]more ants escape into the cup. I will think <abc>[tab][tab]of the garden, how the tomatoes<abc>[tab][tab]split their skins yesterday, how the zucchinis<abc>[tab][tab]swelled to the size of clubs, how we will<abc>[tab][tab]have stood ankle-deep in the mess of it, <abc>[tab][tab]our hands sticky with sap. You will have<abc>[tab][tab] already wiped the counter clean three times. <abc><abc>[tab][tab][tab]Tell me, tell me: How was the juice?<abc>"
      }
    ],
    "cover": "/cover/2025.png"
  },
  {
    "year": 2024,
    "data": [
      {
        "title": "Liebesleid (2024)",
        "content": "Night falls to day as day yields to night—<abc>My heart is in turmoil. I can’t sleep, I<abc>can’t sleep, and so I go to you. The window<abc>is wide open—yet you, you don’t let me in.<abc>I go to you and it’s dark and you’re not there,<abc>I give you to my dreams and you don’t let me<abc>out. My heart, it sleeps and wakes. For an hour,<abc>for a mere moment, I only love you in dreams.<abc>Open your windows again, let me give you<abc>the night—my heart, the moon—my lips. Yes, I<abc>remember: I kissed you, I kissed you forever.<abc>My heart is on the floor, constellations pumping<abc>through its arteries. I stand on the windowsill,<abc>moon in place of my heart. It loves you so much—Oh,<abc>my heart is in turmoil, my heart is in turmoil.<abc>Don't you see? The moon pulsing in your palms,<abc>the night a tide of darkened red washing over you and I.<abc>Your glowing lips that taste of seawater,<abc>where I drank Cassiopeia and Cepheus from,<abc>part and turn to mine.<abc><abc>Nightfall in your arms, moonrise in your gaze,<abc>my face a petal of light from your own.<abc>Liquid sunlight pours through the windows and<abc>fill my lungs. We are Earth—no—this is Earth.<abc>My heart turns to eclipse: you, a ring of light,<abc>enveloping around me, reverberating syzygy—<abc>The wave reaches out its lamenting hand,<abc>brushing over your glazed, gleaming eyes.<abc>Deluge of refracted stars and brittle moon—<abc>Your heartbeat (the crumbling of mine)<abc>crashes onto the horizon, the tides.<abc>"
      },
      {
        "title": "Rainwater Marinade (2024)",
        "content": "I<abc>Autumn seeps into your skin like an ice-cold marinade.<abc><abc>A thousand spices you know not the names of. You can read<abc>the labels, but the mother tongue is alien to your mouth.<abc>A thousand people you know not the names of. You can greet<abc>them, smile, answer their excited questions. They know yours.<abc>They know you as that-and-that and as your mother’s daughter<abc>and your grandmother’s niece and the pride of your home,<abc>the pride of your parents, the suffering of your parents,<abc>the suffering of your mother, the destruction of your mother.<abc><abc>Does she not know that her womb is a grave?<abc><abc>II<abc>Autumn seeps into your flesh like an ice-cold marinade.<abc><abc>Your mother cuts into the meat and her knife goes through<abc>the cold, tender flesh as easily as it would yours.<abc>Look, she says, this is how you slice beef to be sauteed.<abc>Your mother cuts into the finger and her knife stutters,<abc>wails, and Ouch! and red, fresh blood. At school, you<abc>have been taught that such blood flow equates to a damaged<abc>vein. Is your blood authentic? Can it only be proved<abc>when it is seen? She slices her bare feet on the rocks,<abc>slices her arms on blades of grass, slices her heart on the<abc>chopping board. Add some salt and pepper and heat.<abc><abc>You both act like pain can be seasoned away. You both<abc>know this better than anyone else.<abc><abc>You are better with knives, now. You can cut and dice<abc>and shallots don’t hurt you like they used to (well, they do,<abc>but you hold it in better), and you still don’t know the spices,<abc>but that’s okay, because you never use them anyway.<abc><abc>III<abc>Autumn seeps into your bones like an ice-cold marinade.<abc><abc>September has never been nice to you. It keeps on raining,<abc>and you keep on running, and you pretend that you hate it.<abc>Your shoes are soaked in rain, and you don’t take them off,<abc>and your feet feel cold, but you keep running. September<abc>will never, never, never be nice to you. Your clothes are wet.<abc>You will never, never, never shake the water off.<abc><abc>She bleeds into the meal, as you do. You are more seasoning<abc>than self. You are a dish prepared by unfamiliar hands. You<abc>are wet clothes sticking to skin and the splashing of rainwater<abc>under your feet. You know the spices now: star anise, cinnamon,<abc>turmeric, five-spice powder, peppercorn. You never use them<abc>anyway.<abc><abc>History is marbled, like meat; you are, too.<abc>"
      },
      {
        "title": "Summer Vacation (2024)",
        "content": "Summer is in the clouds that burn<abc>like forest fires. Pick up the strings<abc>of light on the sidewalk, my dear, <abc>we’ll weave a ladder to the heavens.<abc>Summer is in the flowers, the blooming,<abc>the prime of the self. Summer is in the<abc>ripening of fruit that fall to the ground<abc>and left to rot. <abc>No one knows when Spring <abc>turns to Summer, when growth<abc>turns to aging, when aging turns to<abc>dying.<abc>A burgeon of heat, of rain, of torn<abc>phoenix wings lying on the streets.<abc>And we both hear the chirping<abc>of cicadas at night, the beckoning<abc>of lovers over blooming lotuses,<abc>rippling in the water like summer rain.<abc>Even the greenest of leaves cannot<abc>stand summer’s storms. <abc>Sleep now, dearest, and hope that <abc>the rainwater thumping on our window<abc>trickles not into our room. "
      },
      {
        "title": "Chromatics of Vertigo (2024)",
        "content": "The way that tea sounds golden<abc>when poured into two cups,<abc>The blue of the beholden,<abc>Lifelike, gasping air, floating up:<abc>Touch in the ripple of night,<abc>curling fingers, nails digging in,<abc>grasping, tearing open the sky,<abc>Suppose this wind stirring within,<abc>condensing into a whirlpool,<abc>sinking to the bottom of your tea,<abc>Suppose this wound, tenderly cruel,<abc>chasing away stars, glowing debris,<abc>And the birds that chirp in pauses,<abc>hitchhike on the fleeing comets,<abc>Leave the ones that do in clauses,<abc>conjunctions, aureateness, prophets,<abc>Naked sunlight on naked voice,<abc>each refraction a shard of glass—<abc>weaved into blinking eyes, moist,<abc>the chromatic scale, collapsed,<abc>Into the eye of the needle,<abc>it falls, through rabbit holes,<abc>Into the brush on the easel,<abc>it sinks, paper and coal.<abc>Into the very thought of you,<abc>immortalized in luster,<abc>The sky, tumbling in vibrant hues,<abc>blooming stars in clusters.<abc>And so, how can I be anything but poet<abc>when you hold the entire world within you?"
      },
      {
        "title": "Chromatics of Vertigo (2024)",
        "content": "The way that tea sounds golden <abc>when poured into two cups,<abc>The blue of the beholden, <abc>Lifelike, gasping air, floating up:<abc>Touch in the ripple of night, <abc>curling fingers, nails digging in, <abc>grasping, tearing open the sky,<abc>Suppose this wind stirring within,<abc>condensing into a whirlpool, <abc>sinking to the bottom of your tea,<abc>Suppose this wound, tenderly cruel,<abc>chasing away stars, glowing debris,<abc>And the birds that chirp in pauses,<abc>hitchhike on the fleeing comets, <abc>Leave the ones that do in clauses,<abc>conjunctions, aureateness, prophets,<abc>Naked sunlight on naked voice, <abc>each refraction a shard of glass—<abc>weaved into blinking eyes, moist,<abc>the chromatic scale, collapsed,<abc>Into the eye of the needle, <abc>it falls, through rabbit holes, <abc>Into the brush on the easel,<abc>it sinks, paper and coal.<abc>Into the very thought of you,<abc>immortalized in luster,<abc>The sky, tumbling in vibrant hues,<abc>blooming stars in clusters.<abc>And so, how can I be anything but poet <abc>when you hold the entire world within you?"
      },
      {
        "title": "Autumn #2 (2024)",
        "content": "Here lies my heart.<abc>Here lies my liver.<abc>Here lies my kidneys, my lungs, my stomach.<abc>Where is my brain, you ask? To that, I have not an answer—<abc>They drained my brain already.<abc>I no longer think, no longer speak, no longer live.<abc>They drained me of my water, my blood, my sanity;<abc>They drowned me in salt, in cloth, in contempt;<abc>They took my organs—my hopes and plans, what I wanted to be;<abc>Over my face—or the corpse that used to be me—<abc>They put a golden mask, a caricature of mockery;<abc>covering my eyes—my view, my mouth—my voice,<abc>turning me into the creature they wanted me to be.<abc>They carved a sarcophagus out of my dried tears<abc>and called it art, called it justice—<abc>They built a pyramid of lies and stuffed my lifeless body into it,<abc>and praised the mask of gold suffocating me.<abc>Inside my tomb, I weep, and they collect the gems falling from my eyes,<abc>calling them invaluable treasures, smiling greedily,<abc>I do not care, I need not care—<abc>For what use are blinded eyes? What use is a mute mouth?<abc>What use has an unheard voice? What use have I, a dead body?<abc>Here lies my empty, hollow corpse. <abc>"
      },
      {
        "title": "Envy (2024)",
        "content": "I write with the sap of my feelings, <abc>blood of my soul, heart near half-whole. I sing<abc>with the tears of my eyes, thirst of my sight,<abc>lust for frail life. Your hand is a hand only<abc>when damned; your voice is a voice just by<abc>my choice; my curse a welcomed hurt, my <abc>pen a cruel lens, I write you, creation of<abc>myself. You write with light in a limbo <abc>and gusts in a field and wounds near<abc>half-healed. You create with a fervor, <abc>a passion, a disgusting attraction. You<abc>make things I never can, beautiful, beautiful <abc>things—I love you, I love you so much.<abc>I love you so much, I want you to die. The <abc>beauty of unreachable gentleness, distant <abc>tenderness, the words born from your pen: <abc>meaningless radiance. I am the black hole <abc>that consumes all light, the sudden coldness<abc>of night; you are the thing for which I yearn,<abc>from which I learn, the object of my violence.<abc>Speak, creation of myself. Speak of the love<abc>I poured into you that left me empty, the <abc>doves bursting from your palms I could<abc>never conjure. Speak of all that is feathery <abc>and mellow, all that is light, all that will <abc>wither and die.<abc>"
      },
      {
        "title": "Untitled (2024)",
        "content": "Butterflies do not breathe midnight air,<abc>their wings coiling under dew and freezing. <abc>A rip through the wings,<abc>the leaf-like chrysalis tearing <abc>Milk spills on trembling hands,<abc>the soft, tender pulp of almost-flight:<abc>Down, in a tremble, it throws itself<abc>head-first into concrete. <abc><abc>Godiva, too, mourns it, shames it; <abc>life, too, guides it, drives it, <abc>the slow<abc>\tslow <abc>\t\tdive. <abc><abc>Here, I stand, where they have <abc>clothed me<abc>and you have claimed me<abc>as malformation and rage,<abc>as aberration and hysteria<abc>and she-Frankenstein of the New World<abc>that I am broken and bruised<abc>A thing to be fixed, a girl <abc>small, tiny, vulnerable, changed—<abc><abc>And this soul—this soul, ingredient <abc>of mine—shall fall, suicidal,<abc>into the bubbling cauldron<abc>From which, none but <abc>the Truth shall rise. <abc><abc>All rehearsals must eventually end:<abc>If I must die, let it be brilliant. <abc>If I must die, let it blind. <abc><abc>Even broken wings remember <abc>the feeling of sky. <abc>The pavement will learn how bright<abc>this puny, meaningless, <abc>tiny, tremendous, vibrant<abc>Truth<abc>can bruise. <abc>"
      },
      {
        "title": "Autumn #1 (2024)",
        "content": "August. August. How I despise August,<abc>with your rains and gale. <abc>How I despise your stillborn storms, the tip of your fingers<abc>meeting mine in an indescribable warmth.<abc>As if you touched your reflection in a lake,<abc>but I don't ripple—I merely stand, your gusts pulling me backwards<abc>and my gravity, in waves, pulling you impossibly closer to myself, <abc>an imitation of water creasing when touched.<abc><abc>I let you whip yourself around me, your petals<abc>falling gold and green, dead and alive, light and shadow.<abc>I breathe you. I breathe you again. I breathed in so much of you,<abc>I use your name. I call myself 'August'. <abc>Sing change. Sing renaissance. Sing rebirth. <abc>Sing insolence. Sing egotism. Sing my words.<abc><abc>A choir of two, me and you, and I'm just me <abc>and you're everything else. My voice is yours and <abc>your voice is a paragon of myself. <abc>How afraid you are of me, in my all-encompassing voracity, <abc>and how afraid I am of you, in your sea-gentle rage.<abc>"
      },
      {
        "title": "Lust (2024)",
        "content": "Bury me on Parnassus. Bury me, fully alive, <abc>on the hill of the Muses, on the remnants of you. <abc>I’ll knit your intestines into a blanket, warm and light—<abc>You feel like home. My needles dance, and I am a needle, too.<abc>Your eyes are beautiful. Your veins are beautiful.<abc>You are Prometheus and I the eagles—you are immutable,<abc>unstirring in your revoltingly beautiful slumber.<abc>I am drenched in you, covered with you and I wonder<abc>if you will also devour me like I currently am.<abc>When Hunger presses her parched lips to mine, I'm damned—<abc>utterly, utterly damned, my insatiable appetite for everything<abc>you sap away my humanity again. I take and take, my teeth burying<abc>into your flesh—the human liver melts in one's mouth.<abc>I sink my teeth into your heart and light bursts out—<abc>holy, cleansing light, illuminating my bloodstained face,<abc>where Hunger takes your image when she traps me in her embrace.<abc>Come, Erato, and take Melpomene with you,<abc>witness this great profession of the soul. <abc>Immortalize my skin in these crimson hues,<abc>and I'll write you a poem of this devastating, ethereal love.<abc>"
      }
    ],
    "cover": "/cover/2024.png"
  },
  {
    "year": 2023,
    "data": [
      {
        "title": "Autumn #3 (2023)",
        "content": "As dust returns to dust,<abc>And time, too, turns to rust,<abc>As night lends light to day,<abc>Autumn: breeze-tinted May.<abc><abc>Moon drowns in sea-swept grief,<abc>Grain weeps in rhyme and reap,<abc>Wind howls in mourning song,<abc>Wailing, Death is long gone.<abc><abc>Hold me gentle, tender,<abc>You, in your deathly splendor,<abc>Decay, a falling embrace, <abc>Moment, a lifetime retraced.<abc><abc>An eulogy for you, Autumn,<abc>You of leaves and mortem,<abc>Drifting, the light of dusk,<abc>Hollow, the glow of husk.<abc>"
      },
      {
        "title": "Wrath (2023)",
        "content": "On the days I wake up, there is a gun in my throat. I open my mouth <abc>and fire into the sky, a sound-shattering explosion. <abc>I expel the remnants of ash from my pharynx,<abc>cough after painful cough. <abc>Bullet. Father. Bullet. <abc>There lives a factory inside my lungs, lead and powder<abc>and flammable air. There lives a grief inside<abc>my eyes, sunset and winter and biting shivers.<abc>There lives a yearning inside my throat, <abc>itching and festering and burning desire.<abc><abc>Red. I see red. Like lanterns, like ambulances, like blood. <abc>They hand me a tear-stained pouch of luck. That, too, is red. <abc><abc>I see red. I open my mouth to say Thank you. I shoot them instead.<abc><abc>I wake again in the hemorrhaging blue night,<abc>skies bleeding, torn open, bullet holes dotted throughout, shining—<abc>Sap, clear and flowing, forms puddles on the ground. I open my mouth.<abc>Gunpowder does not ignite when wet, <abc>nor does oxygen when there is no place for it. <abc>All that scorches is soothed by the eroding gentleness of water,<abc>the same wounds, same fractures, same injuries. <abc>Sometimes, drowning hurts more<abc>than getting burned. <abc>"
      },
      {
        "title": "The Princess and the Frog (2023)",
        "content": "There's a frog-shaped hole in my bookshelf.<abc>There's a frog-shaped hole in my hair <abc>and a frog-shaped hole on my finger. <abc>In this place, where the void ends at the skyline<abc>and the mountains demolish themselves in homes,<abc>I miss you terribly. How I wish I could have the panic<abc>of trying to fill the frog-shaped hole in my hair again.<abc>How I wish I could hold it tenderly–how I could hold you.<abc>A mirror, a scale, an author. Many authors,<abc>actually. Shakespeare and Kafka and Verlaine and Rimbaud.<abc>And everything else, a little crocheted accessory and a misplaced order.<abc>They put your flat on rent—how I wish I could be the renter. <abc>Wake up. Sit in the place you did. Bake the same treats you did.<abc>Maybe it's a crime to love two people at once <abc>and I stand in court and croak like a frog.<abc>I'm my own prosecutor and you're on the jury—in fact, <abc>you are the jury. I look at you, at your <abc>hair and your eyes and your frog-shaped ring,<abc>and beg you to indict me guilty.<abc>"
      },
      {
        "title": "Catharsis(2023)",
        "content": "You were here. Once, you told me <abc>that you felt like drowning. <abc>I am an ocean too shallow to swim <abc>in. You can only wet your feet, wade <abc>ankle-high in the light. <abc>You can only walk along the edge<abc>of the shore. Yet, you drown anyway.<abc><abc>You are dead. The only witness to <abc>your murder was the moon. There <abc>is no autopsy nor heaven waiting. <abc><abc>Where the stars shatter like glass<abc>and waves weep without sound, <abc>there exists no grave nor <abc>meaningless marks on sand. <abc>You come to me, bloated<abc>and strangely taken on<abc>the color of the sea.<abc><abc>The creature grabs my trembling ankle<abc>and pulls with all its might.<abc>A single star falls onto my forehead<abc>dampened with sweat. <abc>Eyes wide, childlike, ghost of a tremor<abc>in their unblinking terror. <abc><abc>The moon turns her face,<abc>silver and indifferent.<abc>Nothing changes,<abc>nothing is forgiven.<abc>"
      },
      {
        "title": "Sometimes I Talk About You Like You’re Dead (2023)",
        "content": "like you’re gone, long gone, or so I said.<abc>Almost like stabbing a painting and going over with red.<abc>You picked me open and stitched marbles into my sight<abc>(a symphony of words exploding mid flight).<abc>The clouds, too, bleed: edges of mist and sky—openings of wounds—<abc>light spilling on darkened skin, thunderstorm violin-tuned.<abc>Rest in peace, dearest. Woe is the heart of the wanter,<abc>that a mirage of you is the hunted and I the hunter.<abc>A crack. Lightning. Flicker. A vestige, a whisper. <abc>When we meet again (I hope we never do),<abc>I’ll still be stuck loving an echo (It used to be you). <abc>And you and your voice and your kaleidoscopes of colors<abc>—which has been spun countless times, of course—<abc>and I’ll tell you that I missed you (which only grows duller)<abc>and rain, rain, incessant rain, and we’ll waltz. <abc>A crack again—the skin ruptures. A momentary bruise,<abc>a flick!—staccato. A gift wrapped in rushed excuse,<abc>a muttered apology, from me to you and only you. <abc>The smell of petrichor. Sweet-smelling grass,<abc>inky dew. I hold water in my hands, a futile grasp,<abc>Goodbye, my dear. Let’s never meet again. <abc>"
      },
      {
        "title": "Thalassophobia (2023)",
        "content": "is the fear of the deep. Not the waves,<abc>not the wind, but the hungering dark,<abc>the whale’s jaw yawning wide, my own face<abc>rippling back in the black.<abc>I am no Ahab. No whalebone leg, <abc>no scar like lightning, <abc>Just these shoes, salt-heavy, sinking,<abc>and my neck, pulse, pulse, pulse.<abc>I hold no harpoon nor rope in my hands,<abc>no compass nor hope and<abc>I am its hearse as it is mine. <abc>There has never been a storm, only <abc>the gloomy, shivering sky. <abc>There is only the drift, the slow pull<abc>of orbit: the whale and I, until collision.<abc>No chase, the inevitable: <abc>its eye, my eye, its throat a cathedral<abc>of swallowed light: a thousand glowing selves,<abc>curled like stillborn fetuses, like krill.<abc>"
      },
      {
        "title": "Mother (Other) (2023)",
        "content": "There lives a woman at the foot of my bed,<abc>Slumped over, hanging her head, <abc>Weeping, weeping, for her and I, <abc>Weeping, weeping, for the sun to rise.<abc>She mourns me, like I’m nothing but dead,<abc>She mourns her, like she’s been condemned.<abc><abc>There lives a woman next to my desk, <abc>Shouting, screaming at the grotesque,<abc>I’m crying, crying, as the defendant, <abc>I’m trying, trying, to seem repentant. <abc>Guilty! she declares, banging the hammer,<abc>I’m sorry, sorry, I manage to stammer. <abc><abc>There lives a woman next to my desk,<abc>Breathing, breathing, down at my neck,<abc>Whispering words I dare not repeat,<abc>Cold as the grave, yet scorching as heat.<abc>You owe me, she sighs, with venom so sweet,<abc>You owe me the life you swore you would keep.<abc><abc>There lives a woman inside my head,<abc>Louder than reason, darker than dread.<abc>She spins me in circles, she tangles my thread,<abc>She tells me the living are better off dead.<abc>And when I beg her to leave me be,<abc>She smiles and whispers—<abc>But darling, I’m thee.<abc>"
      }
    ],
    "cover": "/cover/2023.png"
  },
  {
    "year": 2022,
    "data": [
      {
        "title": "Mummy (2022)",
        "content": "Here lies my heart.<abc>Here lies my liver.<abc>Here lies my kidneys, my lungs, my stomach.<abc>Where is my brain, you ask? To that, I have not an answer—<abc>They drained my brain already.<abc>I no longer think, no longer speak, no longer live.<abc>They drained me of my water, my blood, my sanity;<abc>They drowned me in salt, in cloth, in contempt;<abc>They took my organs—my hopes and plans, what I wanted to be;<abc>Over my face—or the corpse that used to be me—<abc>They put a golden mask, a caricature of mockery;<abc>covering my eyes—my view, my mouth—my voice,<abc>turning me into the creature they wanted me to be.<abc>They carved a sarcophagus out of my dried tears<abc>and called it art, called it justice—<abc>They built a pyramid of lies and stuffed my lifeless body into it,<abc>and praised the mask of gold suffocating me.<abc>Inside my tomb, I weep, and they collect the gems falling from my eyes,<abc>calling them invaluable treasures, smiling greedily,<abc>I do not care, I need not care—<abc>For what use are blinded eyes? What use is a mute mouth?<abc>What use has an unheard voice? What use have I, a dead body?<abc>Here lies my empty, hollow corpse. <abc>"
      },
      {
        "title": "corpse of summer (2022)",
        "content": "wailing winds of autumn brushes through the leaves of the tree<abc>and summer dies too quickly, leaving only husks and decaying debris<abc>orange leaves fall while others cling to their branches, already half-dead<abc>because autumn is only a beautiful corpse, covered in shades of yellow and red<abc>if it was a song, i’m sure autumn would be an opera of regret<abc>of plants and humans alike, of feats not a single being would forget<abc>yet its harmony sounds strangely familiar, akin to a sonata of death<abc>for autumn is one of death’s many incarnations, and its most beautiful one<abc>in the form of blowing gales that carry scarlet leaves against the setting sun<abc>in the corners of the streets where children play—the leaves under their feet go crunch, crunch, crunch<abc>in the pockets of fading sunlight on my hands; and the corrosion begun<abc>when the trees outside my window bare their naked thin limbs<abc>when one more yellowed leaf fall into the ground, the end of a nymph<abc>that’s when i know death in its most beautiful form is descending into my oxidizing world<abc>and i open my arms. breathe the autumn air. embrace death unperturbed.<abc>"
      }
    ],
    "cover": "/cover/2022.png"
  }
]
