[
  {
    "title": "The Jar",
    "cover":"/cover/story1.png",
    "content": "There's a little jar under my bed. I don't know when or how it got there, but it's always been there, and, frankly, I don't care about it—not anymore, at least. Sometimes, I pick it up and shake it—a pretty little thing made of tinted glass with a lid of gleaming metal—but it always seems to be empty despite the clanging sounds it makes whenever I shake it. I always found that a little creepy but it's never budged despite how hard I tried: the lid is nigh unopenable, the glass survived a three story drop and it always returned to me no matter how I tried to throw it away. I've accepted it, more or less, a little magical (cursed, maybe?) jar under my bed. -abc-It's weird. The jar's colors change and flash in ways I will never understand: dusky blue, pale coral, alabaster off-white, honeysuckle yellow, bright anemone red, wolfsbane purple. The purplish-pinkish white of the Cretan dittany, the scarlet of hyacinths, just like the one in the myths, the brown of hickory—more green than brown in its earthiness. It's colorful this instant and clear the next, and I don't know what to make of it. -abc-I've seen it in my dreams at times. In my dreams, the jar opens and the contents of it flows and weaves around my fingers, a shimmering river of fabric carrying the texture of memories I've long forgotten. The more I try to grasp onto it, the more it seeps through the cracks of my fingers and out of my palms, not unlike water. It speaks the language of rustles; of ethereal, wind-like whispers entangled together in a silent cacophony; of an orchestra made of wrong notes: a misplaced piano key, the blunt noise from the muted vibrations of a guitar, a mistuned violin string. All of these I can't and will never understand. -abc-When I wake, sunlight illuminates the jar, its shine burning away the fragile glass.-abc-At times, I feel like it's the only constant in the turbulence of the life I've allowed myself to be swept in. I say that as if I had a choice, but I never really did—a laughable existence in an equally laughable world. Everything is so slow yet so fast at the same time, the hours I have in a day untangling itself from my fingertips and pulling away, and so the only thing I can do is tie the threads as tightly as I can around my wrists so they can drag me with them, inevitably cutting off the blood supply from my hands. Once my hands are dead, I tie them onto my feet. Once my feet are dead, I tie them onto wherever I can. Now they're on my neck, and I can feel myself getting lightheaded and breathless when they pull me through the weeks and months that I have left of myself. I attempt to raise a rusted pair of scissors with my shaking, necrotizing hands to try and cut the threads I've bound to myself—only to drop them on my feet and wound myself even worse. -abc-Forgetting is an art of its own, and I've perfected it. It takes skill to forget all the important things in my life but remember all the useless things that clutter my brain. I don't remember my mother's name or my birthday, but I remember the first hundred numbers of the value of pi. I don't remember who the person I see in the mirror is, but I remember all of the one hundred and eight elements in the periodic table. When I'm bored, I recite the elements of the world to my reflection like a futile attempt at reclaiming my physical body. Hydrogen. Carbon. Sulfur. Potassium. Oxygen. Phosphorus. Sodium. Magnesium. All the elements making up me are spilling from my lips—I want to throw up my body and get rid of them all. We've met before, I mutter to the reflection in the mirror. Don't lie to me, it mutters back.-abc-The jar witnessed all. It speaks nothing.-abc-*-abc-The last time I dreamt about the jar was a bit of time ago—I can't say I haven't missed it. The more comfortable I become with it, it seems, the further I grew apart from it. I can't say if that's a good or bad thing, but I do miss the days where I'm intrigued by it, the days where I would bring it to places, the days I tried to destroy it. It's becoming more and more like a part of the physical world to me than a magical item. Just another thing in my room. No more, no less. -abc-There's been a series of moments lately where I catch myself forgetting it exists entirely. Hours pass, sometimes days, where the jar doesn't cross my mind at all. And then, in the quiet spaces between breaths, I remember—and the remembering feels like losing something all over again.-abc-*-abc-He was in pain. Anyone would've known it as his knuckles turned white when he gripped the little jar in his hands and writhed about in his sleep. Memories flooded back into his dreams in vestiges—the aroma of poppies, a dog-eared page from some discarded book, shards, shards, so many shards.-abc-The woman watching from the doorway had seen this before. She'd been coming every Tuesday for three months now, part of the hospice rotation. The young man in the bed—barely thirty, the chart said, though he looked both older and younger somehow—always clutched that jar during the worst of it. -abc-She approached quietly, practiced hands checking monitors, adjusting the IV drip. The morphine would help with the physical pain, but whatever haunted his dreams was beyond her medicine. The jar pulsed with colors she pretended not to see, for medical training had taught her to document only what could be measured, weighed, verified. But she saw them anyway: the blues of forgotten skies, the reds of unspoken words, the greens of paths never taken.-abc-'It's okay,' she whispered, though she knew he couldn't hear her through the layers of sedation and dreams. 'You can let go.'-abc-His grip on the jar loosened slightly. For a moment, she thought she heard it singing—that wrong-note orchestra he sometimes mumbled about in his more lucid moments. The sound of everything that never quite fit together, trying anyway.-abc-*-abc-I'm awake now. Or I think I am. The boundaries have gotten fuzzy lately, like watercolors bleeding into each other on wet paper. The jar is warm in my hands, almost fever-hot, and for the first time in all these years, I feel the lid beginning to give.-abc-It's not fighting me anymore. Or maybe I'm not fighting it.-abc-The threads around my neck have loosened. Not cut—I understand now they were never meant to be cut—but untangled, one careful loop at a time. My reflection in the jar's surface doesn't argue with me anymore. We've made peace, or perhaps we've just grown too tired for conflict.-abc-I reach for the jar. -abc-When the lid finally opens, there's no dramatic revelation. No surge of magical energy or explosion of long-lost memories perfectly preserved. Instead, there's just... space. Empty space that isn't empty at all, but full of all the things that never needed names: the pause between heartbeats, the moment before sleep, the silence after the last note of a song.-abc-I tip the jar, and nothing pours out because nothing was ever trapped inside. It was always just reflecting what I brought to it—all my forgotten things, my tangled time, my elements recited like prayers to a body I was trying to escape.-abc-The woman (nurse? angel? dream?) is saying something about visiting hours being over, but visiting hours don't apply to jars or to the people who carry them. I set it down gently on the nightstand. Someone else will find it, maybe. Under their bed, in their closet, in the corner of their vision when they're not quite looking.-abc-It will change colors for them too. It will sing its wrong songs and keep its impossible secrets and return when thrown away. It will be exactly what they need it to be, which is to say: a mystery they can hold without solving, a constant in the chaos, a small, strange proof that magic—or something like it—insists on existing even when we stop believing in it.-abc-The jar is no longer under my bed. -abc-I think, perhaps, I am no longer above it.-abc-The last thing I remember thinking, before the thinking stops, is that forgetting isn't an art after all. -abc-It's a gift."
  },
  {
    "title": "Orthodontics",
    "cover":"/cover/story2.png",
    "content": "I.-abc-My yearning is alive. It's disgusting. It's pulsing and fleshy and wet. It rests next to my teeth and writhes out your name (which tastes like the glue they use when they put on my braces). Did you know that my teeth hurt, deep at night, when I close my eyes in a desperate attempt to fall asleep? My teeth hurt a lot, but especially after I got braces. My teeth hurt when my tongue accidentally touches it when I speak. My teeth hurt when I dare to eat, when I dare to consume, when I dare to bite and gnaw and ravage. Sometimes, a brace pops out of its place on my jaws and the metal that binds it together pokes the inside of my cheek. That hurts, too (it felt like it bled, but it never really did). When I’ve gotten used to the pain enough that I can eat again, remnants and scraps of what I devoured gets stuck on the railings of my braces like prey stuck on pikes on the outside of a castle wall. When I smiled, everyone I smiled at saw the leftovers of my meal dripping from my mouth (an exhibit of the consequences of consumption). I asked my friend (who used to have braces) How can you live with these on? and she answered I don’t know, but when I got them taken off, I felt like something was missing in my mouth. I didn’t understand her back then, and I still don’t. -abc-I was scared you’d be as disgusted of them as I was, but you smiled at the sight of yourself on my teeth and pressed your yearning to mine. In that split of a moment, I wished you also had braces. -abc-Once, when I was at the clinic to get my braces tightened, I overheard the dentists talking to a person about getting their braces removed. You’re here to remove braces? they asked, and I could hear the boy’s hesitant affirmative, like he didn’t want to admit it. Of course that would hurt, they continued. Is there any way you can make it hurt less? he asked, but I didn’t hear an answer. I touched my teeth with my yearning, feeling the taste of metal, the taste of you sticking on the crevices of my muzzle. One of the dentists walked over to me and told me to open my mouth. I complied, and she peered at my stained teeth, soiled and blackened by the pieces of you I didn’t want to brush away. You have to clean your teeth better, she scolds me gently. Yes, ma’am. I don’t know why I felt so ashamed. She runs her finger over my teeth (the same way you do sometimes) and my tongue starts writhing again. Keep still, she commands, and I nod. -abc-I wonder if the boy misses them already, those metal companions that witnessed every meal, every kiss, every word shaped wrong around their architecture.-abc-That night, you call me while I'm running my tongue over the new configuration of pain. You tell me about the movie you watched, about your mother's questions, about tomorrow. Your voice pools in my ear and my yearning responds, pushing against my braces until I taste copper, real blood this time. I don't tell you. Instead, I make small sounds of agreement while my mouth fills with the flavor of myself breaking.-abc-You ask what I'm thinking about and I almost tell you: I'm thinking about how my friend was right, how these braces have become part of me, how I dread the day they're removed because then what excuse will I have for this yearning that lives behind my teeth? What container will hold it then?-abc-But instead I said, 'Just you,' and listened to your breath catch, momentarily, like you'd swallowed something sharp.-abc--abc-II.-abc-The list of forbidden foods was extensive: popcorn, gum, caramel, nuts, hard candy, corn on the cob, whole apples. Anything that could break a bracket or tangle in the wires. I became an expert at cutting things into microscopic pieces, at choosing the softest options on every menu. My friends would forget sometimes, offering me things I couldn't have, and I'd hold the forbidden item in my hand. Evidence of my new limitations. -abc-One day, you brought strawberries, cut into pieces so small they were basically mush. You fed them to me one by one, and I could taste your fingerprints in the fruit's sweetness. When a seed got caught in my back bracket, you watched me dig it out with my tongue, fascinated. Does it hurt? you asked. Everything hurts, I told you, which was both true and not the answer to your question.-abc-You learned which foods would stick, which would hurt, which would leave evidence of consumption for hours afterward. You carried floss in your pocket, would discretely hand it to me under tables at restaurants. When we ate together, you chose soft foods too, in solidarity.-abc-But sometimes I caught you eating apples whole, corn directly off the cob, chewing gum with abandon. Your jaw moved so freely, without calculation or consequence. -abc-You noticed me watching once and held out the apple, half-eaten, your bite marks clear in the flesh. Want some? you asked, knowing I couldn't accept it in that form. I shook my head, and you began cutting it into tiny pieces with your pocket knife, so small they could slip between wire and tooth without catching. This is love, I thought, as you handed me slivers of apple that tasted like your mouth.-abc-III. -abc-The orthodontist says I'm making good progress. Six more months, maybe eight. My mother celebrates this timeline like it's a release date from prison, but I feel my yearning panic, pressing harder against the metal barriers that have become its home. What happens to desire when you remove its cage? Does it dissipate like smoke, or does it just find new places to hide?-abc-You're with me at this appointment, sitting in the waiting room reading a magazine about teeth whitening. When I come out with new rubber bands (purple this time, because you said they'd look good), you smile and I see your perfect, unencumbered teeth. You've never needed braces. Your teeth grew in straight, obedient, doing what they were supposed to do without intervention. I wonder if your yearning is different because of this—more civilized, less likely to draw blood.-abc-That night, you kiss me differently. Careful but curious, your tongue finding the new configuration of elastics. You pull back and there's a purple rubber band on your lip. We both laugh, but something in your eyes looks hungry. You put the rubber band back yourself, your fingers in my mouth, and I think about how the dentist's fingers felt clinical, necessary, but yours feel like trespass, like worship, like you're learning the architecture of my imprisonment.-abc-Later, lying in your bed, you tell me about a documentary you watched about medieval torture devices. The iron maiden, the rack, the scold's bridle—that metal mask they'd force onto women's faces to keep them from speaking. Their tongues would be pierced with spikes if they tried to talk. You trace the outline of my jaw as you speak, following the path of my braces through my closed lips. I wonder if you see the parallel, if you understand that some restraints become so familiar we forget they were meant to fix us.-abc-You fall asleep with your hand on my face, and I lie awake running my tongue over my braces, tasting metal and tomorrow and the ghost of strawberries. My yearning has settled now, dormant but present, like it knows its time is running out. Six months, maybe eight, and then what? What happens to the things that grew around obstacles when the obstacles are gone?-abc-IV.-abc- The removal date gets scheduled. Tuesday, 2:30 pm. The receptionist hands me the appointment card like it's a diploma, something I've earned. I put it in my wallet behind your photograph, the one where you're smiling with your perfect teeth.-abc-You start taking pictures of my smile constantly. For posterity, you say. So you can remember. But remember what, exactly? The way metal caught the light? The way I learned to smile with my mouth closed? The way food became a negotiation? Or maybe you want to remember this version of me, the one whose yearning had a visible container, whose hunger was literally held back by wire and ceramic.-abc-Three weeks before removal, a bracket pops off while I'm eating soup. Soup. The softest food possible, and still my mouth rebels. The broken bracket slides around on the wire, clicking against my teeth like morse code. You drive me to the emergency orthodontist appointment, hold my hand in the waiting room. When they call me back, you ask if you can come too. The dentist seems surprised but allows it.-abc-You watch them reattach the bracket with the focused attention of someone studying for an exam. The dentist explains each step, warming to your interest. This adhesive is incredibly strong, she says, but it's designed to release with the right amount of pressure at the right angle. That's why they sometimes pop off during regular eating but stay put through years of use.-abc-On the drive home, you're quiet. Then you say, I think I understand your friend now. About missing them. It's not about the braces, is it? It's about the proof. Proof that things can be changed, that you endured something, that you were willing to hurt for years to become different.-abc-I want to tell you that you're right, that you're wrong, that it's both simpler and more complicated than that. Instead, I run my tongue over the newly reattached bracket, feeling where the adhesive is still setting, and think about how in three weeks, the dentist will apply that precise pressure at that precise angle, and all of this architecture will fall away. My yearning shifts, restless, knowing its days in this familiar cage are numbered.-abc-That night, you kiss me like you're trying to memorize the topography of metal, like you're the one who's going to miss them. And maybe you will. Maybe you've fallen in love not despite the braces but because of them—because they make visible the fact that I'm in transition, that I'm becoming something other than what I was.-abc-When we finally break apart, there's blood on your lip. Mine or yours, I can't tell.-abc-V. -abc-Tuesday arrives wearing ordinary clothes.-abc-The waiting room is full of children getting braces put on, their parents reading pamphlets about payment plans. I am the only one here for removal. You texted earlier: Good luck today. Everything changes now. I didn't respond because what could I say? That I'm terrified? That my yearning has been pacing all morning like an animal that knows the cage door is about to open?-abc-They call my name. The dental assistant is new, someone I've never seen before. She doesn't know the history of my mouth, the years of monthly adjustments, the way certain brackets were always problematic. She's cheerful in the way of people who deal with endings they didn't witness beginning.-abc-The removal is violent. That boy from months ago was right—it hurts. The dentist uses pliers that crack each bracket like tiny bones breaking. The sound reverberates through my skull. Twenty-eight small deaths, one for each tooth that had been held. When she pulls the wire out, it's like unthreading a seam, everything that was held together suddenly loose.-abc-She polishes away the adhesive with a drill that smells like burning. This is the worst part, watching years of evidence being buffed away until my teeth are smooth, anonymous, like they never bore witness to anything at all. The hygienist holds up a mirror. Smile, she says.-abc-My teeth look enormous. Naked. I run my tongue over them and feel nothing but surface, smooth as glass, slippery as ice. My yearning doesn't know what to do with all this space. It expands immediately, filling my entire mouth, pressing against my cheeks, my throat. I feel like I'm drowning in it.-abc-The dentist gives me a retainer. Clear plastic, removable. You have to wear this every night, she warns, or your teeth will shift back. They remember their original positions. They'll always want to return to who they were before we changed them.-abc-Outside, you're waiting in your car. When I get in, you don't say anything, just stare at my mouth. I try to smile but I've forgotten how without the metal as guide rails. You reach over, trace my lips with your thumb. Open, you say, and I do. You look at my teeth like you're seeing them for the first time. Or maybe like you're seeing what's missing.-abc-They look perfect, you say, but your voice carries grief.-abc-That night, I put in my retainer for the first time. My yearning immediately presses against it, testing. But it's not the same.-abc-You watch me settle it into place, this new transparent cage. Does it hurt? you ask.-abc-No, I tell you. That's the problem.-abc-You kiss me then, and for the first time in three years, there's nothing between your tongue and my teeth but wanting. My yearning recognizes yours, finally, both of them set loose in the space between us, uncontained and terrible and free. We taste like ending, like beginning, like the blood we no longer draw.-abc-Later, lying awake with my retainer in, I think about my friend who missed her braces. I understand now. It's not about the metal. It's about the proof that we can be held together even as we're being rearranged. It's about having something external to blame for the ache. Without them, the yearning is just yearning, no excuse or explanation, no medical reason for the hunger.-abc-You're asleep beside me, and I study your face in the streetlight through the window. Tomorrow you'll look at my smile and see straight teeth. You'll forget, eventually, about the metal and the blood and the way I learned to eat around architecture. But tonight, my yearning remembers everything, pressing against my retainer like it's trying to preserve the shape of what we were, even as we become what we are."
  },
  {
    "title": "Ten Seconds",
    "cover":"/cover/story3.png",
    "content": "Hong Lu stops in his tracks at the sight of his lover in the WARP train, changed and distorted almost beyond recognition. Yi Sang’s lower body was entrapped in a mass of bleeding muscle, his right arm turned into a tree-like appendage made entirely of flesh. No, Hong Lu thinks, the limb is more akin to the skeleton of a wing, stripped bare and open, long devoid of the ability to fly. Muscles obscured what used to be Yi Sang’s eyes, throbbing and wet. Every now and then, they made a twitching motion in place of what Hong Lu could only assume was blinking. Apart from the subtle shifting of the creature’s eye-muscle and the persistent pulse of life on its body, Yi Sang is completely still, arms laying flat against his sides and face half-tilted forward. Hong Lu thinks it is as if Yi Sang has been frozen in time (well, he is frozen in time, just in a different sense).-abc--abc-He pauses before the statue carved from flesh and organs and extends a hand to touch its cheek, feeling the warm muscle underneath his gloved fingertips. Its heat spills into his cold hand, and he finds himself wanting to press his face against it for a source of warmth in the freezing train cabin. He feels the subtle shift under his hand: the pulse of the blood coursing through his lover’s veins, the fluids staining his gloves as he gently drags his palm over the flesh. In his trance-like adoration of the body making up Yi Sang, Hong Lu hasn’t noticed the slow, sloth-like movement of Yi Sang’s appendage—muscle and flesh flexing and squirming, moving up his body and gently snaking itself around his arm. -abc--abc-The blade of his spear glares electrical blue. -abc--abc-The only logical decision is to sever the flesh rearing to claim his arm. To sever the warm, inviting connection of human-to-human contact. He can feel Yi Sang’s blood seeping into his cleaner’s uniform, onto his skin, warm and cold and temporal and divine. -abc--abc-It speaks. Or, rather, makes a sound that could have been speech. There is no difference, Hong Lu will understand him all the same. -abc--abc-“Hong…”-abc--abc-He smiles, the corners of his eyes crinkling merrily, the sort of smile you only see on wedding days. “Did you miss me?”-abc- -abc-Overhead, the train’s lights hum softly, or maybe that was his spear. It bathes Yi Sang in a deluge of striking neon blue. He is red where flesh has grown over him and black where electric glow hits him. Hong Lu is no stranger to such a sight, but the mop of raven hair that is unmistakably Yi Sang’s on top of his head elicits something in him—a sort of strange, meandering pity. Pity for himself, for he can only savor this strange vulnerability of body, of flesh, of the corporeal and the transient for a frozen second. -abc--abc-After all, all this—the train, the viscera, the tenderness of skinless muscle—is nothing but transitory. Deciduous, like the silk-wrapped flowers buried in the hillside back at his home.-abc--abc-Yi Sang is warm. Familiar. Soft and hard and wet and dry and cold, warm, cold. He teeters on the moment between life and death, sanity and madness, monster and man. He holds onto Hong Lu’s arm like a vise, embracing him in the only way he knows how to—arms and legs and wing and the soft creaks of slithering tendons. I love you. In this sleepless slumber, this limbo of flesh, he yearns for just a smidgen of sunlight.-abc--abc-He could recognize that shade of jade anywhere. -abc--abc-I missed you. It’s been so long.-abc--abc-There’s a flash, and Yi Sang’s body splits once, twice, thrice. Each morsel of flesh flies onto the air, hitting the walls, the floor. The wing clutching his arm falls to the ground, writhing. If it had a mouth, it would have screamed. His head falls next, then comes limbs and slices of torso. Then the head falls with a loud thud! and the creature is no more. -abc--abc-The mouth opens. No sound comes out of it, for the lungs have been severed. The flesh wrapped around Hong Lu’s arm falls off, joining the viscera piled on the floor. The eye-muscle twitches wildly. The creature screams into the infinity of the train car, screams to the footsteps getting further and further away from the door. -abc--abc-A single tear from the cleaner’s eye rolls onto the floor, warm, splattering against the wet entrails. The fluid is no different from the blood coating these breathing muscles. Hong Lu pauses in his tracks and turns back slightly. He has not felt this way in a long, long time. -abc--abc-He shuts the door and continues on. Soon, Ryoshu will arrive to finish the cleanup. His job is done. -abc--abc-—-abc--abc-Yi Sang brightens as he spots Hong Lu in the station holding a coffee. Hong Lu smiles, runs up to him, and hugs him like he hasn’t in years.-abc--abc-“Is there a predicament?” -abc--abc-Hong Lu shakes his head. “Ten seconds is a long time, you know~ I missed you.”-abc-"
  },
  {
    "title": "the fear: that nothing survives;the greater fear:that something does",
    "cover":"/cover/story4.png",
    "content": "I.-abc-In all his days of studying the arts, Hong Lu has learned one thing: after dark, everything becomes musical. -abc-The swipe of blade against flesh; the slow, constant growth of matter; laughter, death, and all that’s in between them. They move in rhythm, up and down and up again, thirds, fourths, fast then slow then fast before an abrupt STOP! and everything fizzles out in a staggering rest note. -abc-The City hums in the absence of light. Neon signs flicker like staccato notes, their glow reflecting off rain-slick streets. The distant wail of sirens becomes an elegy rising and falling in time with the pulse of the night. Even the silence has a rhythm, a steady, unrelenting beat that Hong Lu feels in his bones.-abc-There are lives he will never know except for the ones he is tasked to end.-abc-II.-abc-It mattered not who spoke first. A gunshot of the fan; the sweeping of blade and air, deceptively gentle in its lethality; and CLANG! CLANG! CLANG! of metal against wood. He hums a song under his breath, each clash reverberating through the air. There is nothing except the metronome of their violence—no past, no future, only the perfect, pulsing now of steel and splintering lacquer.-abc-The resistance is exquisite. Yi Sang gasps, and the sound goes straight to Hong Lu's gut. They move like this, trading wounds like secrets in the dark. The fan's edge traces Hong Lu's collarbone; his blade finds the soft hollow behind Yi Sang's knee. Yi Sang's breath comes in ragged bursts against Hong Lu's neck. His fan trembles where it's lodged between Hong Lu's shoulder blades, not quite deep enough to kill. Not yet. The branches growing from his face brush Hong Lu's cheeks, their leaves whispering nonsense against his skin.-abc-'Again,' Yi Sang murmurs, and Hong Lu obeys, driving his blade home with the same reverent violence of a man reaching between ribs to cradle a beating heart.-abc-When they finally break apart, it's only to catch their breath.-abc-III.-abc-You are nothing if not a body to be used—nothing but tubes pumping eternity into your veins; nothing but a pair of hands calloused enough to pick up a blade; nothing but a pair of arms strong enough to slice open living flesh, living bones. What is it your legs run for, if not to send those who await their doom to hell? What use is there to resistance, to proving that you are something more than your kill count? Why is it you yearn for the sun?-abc-IV.-abc-Porcupines huddle together in winter, trying to find some meager warmth in each other’s prickly, painful bodies; each of their quills drawing more blood as they press closer to each other. -abc-The first time Hong Lu cuts him, the pain blooms like ink in water.-abc-Yi Sang knows the arithmetic of wounds: the precise angle at which a blade must enter to nick the subclavian artery, the exact viscosity of blood diluted by K Corp’s glowing preservatives (thinner than it should be, like wine mixed with rainwater).-abc-Hong Lu’s blade hand trembles where it presses against his sternum. The antiseptic reek of his machinery floods Yi Sang’s nostrils—not the sterile scent of medical bays, but something fouler, like formaldehyde and rotting peonies. It’s the smell of things preserved past their natural decay.-abc-How cruel, Yi Sang wants to laugh, to make a weapon this exquisite and teach it not to want.-abc-The branches on his face rustle as he leans closer. One branch catches on Hong Lu’s lower lip, drawing a bead of blood so red it’s almost obscene against the pallor of his skin.-abc-V.-abc-There is not much difference between intimacy and violence. The proof is here, in the way Hong Lu's blade sinks into Yi Sang's flesh with the same inevitability as a lover's touch—slow, then all at once. The blood that wells between them could be mistaken for passion if not for its metallic bite.-abc-He did not learn how to categorize the way Yi Sang's breathing hitches when his blade grazes Yi Sang’s carotid, or why the branches embedded in his face seem to flower even more when his blood dots their thorns. He gags slightly at the smell of his own machinery as Yi Sang pulls him against the jagged landscape of his body. This is not protocol. This is not efficient.-abc-Yi Sang's laugh is a wet, broken thing. 'Look at us,' he rasps. 'Two corpses arguing over which grave is prettier.' His fan lies shattered nearby, its golden slats scattered: petals at a funeral neither will attend.-abc-For a suspended moment, in their tiny apocalypse, they exist in perfect understanding.-abc-VI.-abc-He wonders if they use the spicebush to decorate funerals. Not the spectacles of Wing executives with their genetically modified lilies and synthetic mourning, but real funerals—the kind where mourners chew the bitter leaves to feel something sharper than grief, where the pollen gilds the corpse's lips more faithfully than any embalmer's gold.-abc-It would be nice, he thinks, to end in the golden expanse of particles, both petal and leaf. It would be nice to die with the fragrance of spicebush lingering in his nostrils, the leaves falling over his face like summer rain. -abc-He attended a funeral once, when he was still human enough to be permitted such things. His hands were clean. He did not remember who laid in the coffin. They gave him a medal shaped like a keyhole and told him it represented access to the world. -abc-He wonders, then, if the petals at the back of the hill, back at his home, smell just as nice. -abc-VII.-abc-They are similar, he had decided, then, the girl and the man. It gnaws at them, he could see, their ache of the soul. She burns her poems in ravenous fire; he burns himself in flames of fragrant spicebush and golden rot. He chases after these flickering vestiges of light, these dying embers of meaning, as if ash could ever reassemble into a hymn.-abc-There is no language that can survive the hunger of this place; no word left untainted by its all-devouring teeth. The cloying scent, the taste of ash on his tongue, ash in his nose, ash in his eyes—-abc-Some truths are like that—once known, they root. Once rooted, they grow. The City provides no soil for such things, but still, they grow. -abc-VIII.-abc-“Let others laugh flower-burial to see:-abc-Another year, who will be burying me?”-abc-IX.-abc-In the end, everything changes. Impermanence is the way of existence.-abc-Here he stands, with pollen in his lungs and poetry rotting his tongue, watching Yi Sang's blood chart impossible constellations across his armor. The soft sound of the splintering of a thousand stasis cycles crumbles in the hollow where his heart should be. -abc-Hong Lu's armor whines in protest as he drops to his knees. The monitors shriek their warnings—contamination detected, emotional corruption at 87%, initiate purge sequence—initiate purge sequence—initiate purge sequence—-abc-Something terrible and tender puts forth its first green shoot underneath the carbon-fiber plating.-abc-(Somewhere beyond that rooftop, the City's lights flicker like votive candles at a roadside shrine. A siren wails three blocks east. A child coughs blood into its mother's apron. The world moves on.)-abc-(Somewhere, on a hill that no longer exists, a child gathers fallen petals in his palms and believes, foolishly, in beauty that lasts.)-abc-"
  },
  {
    "title": "Glass sunlight",
    "cover":"/cover/story5.png",
    "content": "Was it the sunlight, or your gaze so deep?-abc-Autumn mist fell, soft as falling sleep.-abc-Afternoon slanted, light swept the floor,-abc-One day, the clouds rose high and soared—-abc-They herded gold into your hair,-abc-And sorrow settled, pale and fair.-abc--abc-Why then, were autumn leaves still green?-abc-And sunlight yet a thing unseen?-abc--abc-Yi Sang lay back on the soft plush of Hong Lu’s bed, staring into the dull red ceiling. There is something about the dusk-like tenderness of his room that made his memory bleed into the present much too easily. The gentle lamplight spills over the sheets, diffusing lightly into their breaths, into the time folding onto itself of the room. -abc--abc-To some onlooker, only the soft rise and fall of Yi Sang’s chest betrayed his existence. A voice just light enough to break the quiet without shattering it sounded from the other end of the bed.-abc--abc-“You look as if you’re remembering something,” Hong Lu quips gently. “Something warm, or something painful?”-abc--abc-Yi Sang’s fingers twitches slightly, his face crunching in reflex. “They are the same,” he murmured. “The warmth of sun burns more often than it heals.”-abc--abc-Hong Lu’s reply comes just as gently, a thread of curiosity wound through his words. “And yet you still stand in its light.”-abc--abc-The light from the lamp pools across Yi Sang’s cheekbone, casting long, quiet shadows. A soft sigh, not quite bitter, escapes his mouth. “Perhaps I deserve to.”-abc--abc-“Deserve to? Like punishment?” -abc--abc-Yi Sang does not respond immediately. His eyes stay fixed on the ceiling—still, distant—as if the answer were hidden in the faded paint and not somewhere deeper, rawer, beneath his ribs.-abc-“I once sought to write of light, as though it might be ensnared,” he says at last. “Yet ever did it elude my metaphors, slipping through as water through one’s grasp. And still, I labored on.”-abc--abc-Hong Lu laughs, picking up one of the calligraphy brushes he brought from Hongyuan. “Did you, now~?”  The ink smells like burnt wood and something stale. On a thin sheet of paper, he drew figures. A bird mid-flight. A tree shedding its leaves. A figure with dark hair flowing like smoke.-abc--abc-Yi Sang’s eyes catches on it. “Is that meant to be me?”-abc--abc-Hong Lu hums, noncommittal. “Only if you think so~”-abc--abc-The ceiling offers him no more words, so Yi Sang closes his eyes and resigns himself to darkness.-abc--abc-“I dreamed once,” he murmurs quietly, “of a room just like this, where nary a vestige of grief followed me inside, and the sunlight alit upon my hand, not unlike a moth I might keep for evermore…”-abc--abc-Hong Lu rose, setting the brush aside. He came to the bed without a sound, the same way dusk enters a room: gently, and without asking. Sitting beside Yi Sang, he reached for the other’s slightly trembling hand. “Don’t you think something as free as light should be allowed to roam free~? And all you have to do is just lay there and receive it~?”-abc--abc-Yi Sang’s eyes open. Then he blinks, once. Slowly. “Then I know not how to take it.”-abc--abc-Hong Lu hums, laying down next to him. “You don’t have to~ You’re already lying in it.”-abc--abc-Yi Sang exhales, barely audible, like the breath he didn’t know he was holding had been released. The ceiling blurs slightly at the edges, its red hue softening under his lashes. -abc--abc-You walked the park in hush and grace,-abc-As wind and sky resumed their chase.-abc-The grass turned gold beneath the skies,-abc-The light lit up your wondering eyes.-abc-You passed beneath the trembling trees,-abc-Your eyes like glass, like autumn seas.-abc-A hush of sorrow, vast and wide,-abc-Began to swell and rise inside.-abc--abc-Why then, were autumn leaves still green?-abc-And sunlight yet a thing unseen?-abc--abc-They stay like this for some time, not quite relaxed but no longer braced, his fingers loosened slightly in Hong Lu’s. There was something hallowed in the hush that surrounded them, something too fragile to name. Yi Sang felt it prickling against the edges of his awareness, the warmth of a dream he dared not claim. He did not know what to do with Hong Lu’s closeness, only that it did not strike him like a wound. It simply was. -abc--abc-Like that of Young-ji, all the way back when he was still in the League. So, so familiar. -abc--abc-Here, he was held in the light he had once chased with such fervor.-abc--abc-Nights in the City always feel one breath away from ruin. The sky, washed in soot and rust, presses low against their ceiling, burdened by all the things people tried to forget during daylight. Somewhere, Yi Sang’s regret blends indistinguishably into the City’s quiet sorrow. -abc--abc-Outside, the rain pelts against the streetlights, illuminating each raindrop in its neon glow. The rain clings onto the light, dripping down slowly like they were reluctant to leave its warmth, like it was begging a moment more to stay. Yi Sang’s nails dig into Hong Lu’s back as they hold each other in the night, clinging to whatever shards of light remain on their bodies. To confirm, again and again, that something solid remains. The two of them are barely separate now: just outlines against the glow, pressed close like characters written too quickly in the same stroke. Their breath mingles. Their heat holds.-abc-There is no poetry in this embrace. No elegance. Only need, quiet, desperate, shivering. Yi Sang clings to the curve of Hong Lu’s shoulder not as a lover, but as someone who has wandered too long in winter. He presses his face against skin still warm from lamplight, from presence, from staying. And in the trembling hush of the rain’s rhythm, he tries to believe—for just this moment—that light can be held. That maybe, just maybe, it will not burn him this time.-abc--abc-You passed the park, your eyes round, wide,-abc-Aglow with autumn’s glass inside.-abc-And then, as if your soul took flight,-abc-The dusk flowed softly through your sight.-abc-How many times has autumn stayed,-abc-While trees lit candles down the glade,-abc--abc-To lead the sunlight, warm and bright,-abc-Into your gaze, now filled with light.-abc-"
  },
  {
    "title": "Domestication",
    "cover":"/cover/story6.png",
    "content": "I grew up in a small village somewhere in Haiphong. It was around the 80s to 90s—not long after Vietnam had achieved independence, and so the countryside was poor, dirt poor. Around the village, there were eucalyptus trees, towering and dense and stretching as far as the eye can see (which, in hindsight, was not much at all, but to a child, it was the entire world). My parents would often tell me not to go near the eucalyptus forest, that it housed spirits and other such mystical apparitions that I could never hope to understand.-abc--abc-Understandably, I, an eight-year-old at the time, would be terrified—the sort of curious fear you feel when picking up a horror film, knowing full well you would be trembling after. But, more than that, more than the spirits and the ghosts and the myths, it held up the sky—the world as I knew it—like some sort of tree Atlas. We played at its edges, at the feet of this hulking god holding up the sky. Every time its leaves wavered and the skies went dark, we knew that Atlas's grip was getting weaker: that it was going to rain. The forest was not just a place; it was a participant in our lives, a breathing, sighing entity that dictated the rhythm of our days. Its rustle was a language we learned before we could read, its shadows a map of the unknown we were content to admire from a distance.-abc--abc-It was a sunny day when they brought in the machines. My parents told me that it was a good thing our quaint little village was finally getting electricity. “What’s that?” I’d ask, and they replied, “You’ll see.” Their eyes held a light I didn’t recognize—not the warm, flickering light of the kerosene lamp, but a sharp, eager glint. It was the look of a future I couldn't comprehend, a future that required the sacrifice of a god.-abc--abc-The first tree they cut brought storm clouds. The saw, buzzing like it was alive, reared its toothed tongue to eat through the bark of the tree like a leashed crazed dog in the palm of its owner as tiny bits of wood bursted from the groaning bark. “Get back!” They screamed at me to get away from the rabid dog gnawing at the foot of Atlas; and I obeyed in fear of getting bitten myself. But the true bite was the sound, a mechanical, soulless shrieking that tore through the ancient silence of the forest. It wasn't just cutting wood; it was cutting a covenant.-abc--abc-I’ve never seen an actual rabid dog. My parents have warned me about them, about their growling muzzles and how I need to stay far, far away. I’ve heard one once, running through the village in its maniacal frenzy. Its last moments must’ve been agony. The only difference with this one is that it doesn’t die, nor does it suffer. Instead, it was created to destroy and conquer. Right now, it dares to attack the children of Nature, dares to bring the firmament down to the reach of humans. And we, the children, were complicit, lured by the promise of a new kind of magic that required no faith, only a switch.-abc--abc-That night, it rained, and I felt the sky crashing down over my head. It was a physical weight, a pressure on my small chest. The world felt exposed, the ceiling of our existence suddenly ripped away, leaving us naked under a vast, indifferent cosmos. The rain wasn't just water; it was the weeping of the displaced spirits, and the thunder was the groaning of a wounded Atlas.-abc--abc-At school the next day, the teacher called us all to her table and taught us about electricity. In front of her was a dead frog lying belly-up like it was sunbathing. Next to her was a battery connected to its splayed limbs. She carefully attaches a thin wire to each of its limbs and to the battery. “This is electricity,” she speaks, wary seeping from her voice.-abc--abc-There was a beat of silence, and a chilling zap, not unlike those of lightning storms. The legs of the poor frog jerked, the movement inorganic and puppet-like. I took a step back, as if it was Zeus, as if it would strike me with its lightning and thunder, and I would be the next specimen lying open on the cold metal tray. This was the new spirit they had unleashed—a spirit that did not inhabit life, but could mock it. It was power stripped of soul, a force we could trap in wires and batteries, a domesticated lightning that we were now expected to welcome into our homes. The magic of the forest was wild and untamed, a mystery to be respected. The magic of the frog was a controlled, terrifying demonstration of dominance.-abc--abc-Sometime later, they erected odd towers with power lines in the place of the forest. I see birds perching on them, and I used to wonder why they weren’t getting electrocuted like the frog. It was my first lesson in the arbitrary rules of this new world. The rules of the forest were simple: respect it, and it will shelter you. The rules of this new, wired world were cryptic, dangerous, and full of exceptions only the initiated could understand.-abc--abc-The current year is 2020. I am writing this on a laptop plugged into a power port. There are many different such power ports in my home, in which I am stuck in the midst of a raging pandemic. I cannot imagine my current life without this electricity that I feared would envelop me in its untamed wilderness. This current, which once made a dead frog dance, now powers the very device that connects me to a world from which I am physically severed. The irony is a constant, low hum in the background of my life, more persistent than the buzz of any saw.-abc--abc-Has Atlas abandoned us? Or did we, in our ambition to touch the sky he held so patiently for us, simply shrug him off our shoulders? In the safety of my home, I look outside and I barely see any trees, much less the expanse of the eucalyptus forest in my village. This plague is a creation of Nature, of what I used to be dearly acquainted with as a child. Right now, I am running from it. I am running from nature, from the tradition I grew up with. On television, they broadcast news about how staying at home is doing a large part for the fight against the virus, and I feel a piece of the sky—though small, though insignificant—rest on my trembling shoulders. My ancestors hid from monsoons in the embrace of the forest; I hide from a microbe in the sterile embrace of the world we built to keep the forest out.-abc--abc-Since when did change become tradition, and that tradition become change itself? The tradition was to live with Nature, in all its terrifying, spiritual glory. The change was to subdue it. Now, the tradition is to live within this man-made shell, and any change—like a walk in a park, a breath of unfiltered air—feels like a dangerous rebellion. The spirits of the forest we feared have been replaced by a specter we cannot see, and the safety we were promised has become a different kind of cage.-abc--abc-Is this what it means to become an adult, to mature? To exchange a world of gods and spirits for one of ports and protocols? To learn that progress is just a series of elegant, necessary betrayals? I press a key, and a letter appears on the screen—a miracle powered by the same force that felled a god. And in the glow of this modern wonder, I feel a profound loss for the dark, sacred shadows of a forest that no longer exists, and for the eight-year-old who knew, with every fiber of his being, that the sky was held aloft by the grace of trees.-abc-"
  }
]
